//==============================================================================
//myBT121.c
//Структуры и функции контроля и управления BT121
//Предназначен для STM32 c драйвером HAL
//@title       Monit BT121
//@author      Samailovich Yaraslau
//@version     1.0.0.1
//@date        15.05.2019
//==============================================================================
//Includes ---------------------------------------------------------------------
#include "myBT121.h"
#include "main.h"
//DEFINES-----------------------------------------------------------------------

//Variables-------------------------------------------------------------------
//global variables

//local variables

//=========================================================
//Functions
//-----------------------------------------------------------
void MyInitBT121(void)
{         
          //HAL_Delay(50);
          UP_BT_ENABLE;//включаем питание BT121
         // HAL_Delay(250);
          DOWN_BT_BOOT;//для нормальной работы BOOT опускаем в 0 (для перестраховки, поскольку он в нуле по настройкам в кьюбе)
          UP_BT_RST;//переводим Reset BT121 в 1 (нормальная работа)
          UP_BT_LSTAT;
          HAL_Delay(50);
          DOWN_BT_LSTAT;
          HAL_Delay(250);


          

//        DOWN_BT_RST;//переводим Reset BT121 в 0 (сброс)
//        HAL_Delay(250);
//        UP_BT_RST;//переводим Reset BT121 в 1 (нормальная работа)
//        HAL_Delay(200);
//        USART3->DR = 0x00;
//        HAL_Delay(50);
}

void resetBT121(void)
{         
         
          DOWN_BT_RST;//переводим Reset BT121 в 0 (сброс)
          //HAL_Delay(250);
          UP_BT_RST;//переводим Reset BT121 в 1 (нормальная работа)
          //HAL_Delay(250);
          
//        USART3->DR = 0x00;//debug
//        HAL_Delay(50);
}

